Zektopic/esp32-blue-audio-puck/sdkconfig.defaults
# BlueAudio Puck -- project-wide configuration defaults.
#
# Regenerate a working sdkconfig with:  idf.py set-target esp32 && idf.py build
# `sdkconfig` itself is gitignored; this file is the source of truth.

# --- Target -----------------------------------------------------------------
CONFIG_IDF_TARGET="esp32"

# --- Partitioning -----------------------------------------------------------
# The Bluedroid Classic stack pushes the image past the 1 MB default factory
# partition, so use the large single-app layout from the start.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# --- Serial monitor ---------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# --- Logging ----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- Bluetooth ---------------------------------------------------------------
# Classic BR/EDR only: A2DP does not exist on BLE, and dropping the BLE half of
# the controller returns roughly 30 kB of heap.
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_SPP_ENABLED=n

# --- Power ------------------------------------------------------------------
# Dynamic frequency scaling. Light sleep stays off: the Bluetooth controller
# keeps its reference clock on the main crystal, which supports DFS but not
# light sleep, and light sleep would break audio timing regardless.
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_BTDM_CTRL_MODEM_SLEEP=y
CONFIG_BTDM_CTRL_MODEM_SLEEP_MODE_ORIG=y
CONFIG_BTDM_CTRL_LPCLK_SEL_MAIN_XTAL=y

# --- Pairing ----------------------------------------------------------------
# Secure Simple Pairing has no Kconfig symbol in ESP-IDF v5.5.4 -- the
# `CONFIG_EXAMPLE_SSP_ENABLED` seen in the IDF examples is example-local, not a
# stack option. SSP is selected at runtime through
# `esp_bluedroid_config_t.ssp_en`, which bt_core sets explicitly.

# --- Battery -----------------------------------------------------------------
# The reference board fits a 2:1 divider from the cell to GPIO 35, so tell the
# firmware it is there. Without this the component reports PUCK_BATTERY_ABSENT
# and the screen shows "USB" no matter what is wired -- which is correct
# behaviour for a board with no divider, and baffling on a board that has one.
#
# Set this back to -1 for a build with no divider: an ADC on a floating pin
# reads noise, and a confident wrong percentage is worse than an honest "USB".
CONFIG_PUCK_BATTERY_ADC_GPIO=35
